# The Series Data Structure

In [8]:
import pandas as pd
#pd.Series?

In [9]:
animals = ['Tiger', 'Bear', 'Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [10]:
animals = ['Tiger', 'Bear', None]
pd.Series(animals)

0    Tiger
1     Bear
2     None
dtype: object

In [11]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [12]:
import numpy as np
np.nan == None

False

In [13]:
np.nan == np.nan

False

In [14]:
np.isnan(np.nan)

True

In [15]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s # Python dictionary into series (keys go to index)

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [16]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [17]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index = ['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [18]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey']) # Hockey not in a dictionary returns NaN
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

# Querying a Series

In [19]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [20]:
s.iloc[3] # Returns the value of index 3

'South Korea'

In [21]:
s.loc['Golf'] # iloc and loc are attributes

'Scotland'

In [22]:
s[3] # s[3] == s.iloc[3]

'South Korea'

In [23]:
s['Golf'] # s['Golf'] == s.loc['Golf']

'Scotland'

In [24]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)
s

99          Bhutan
100       Scotland
101          Japan
102    South Korea
dtype: object

In [25]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [26]:
s[0]

100.0

In [27]:
total = 0
for item in s:
    total+=item
print(total)

324.0

In [28]:
import numpy as np

total = np.sum(s)
print(total)

324.0

In [29]:
#this creates a big series of random numbers
s = pd.Series(np.random.randint(0,1000,10000))
s.head()

0     69
1    913
2    218
3     64
4    821
dtype: int32

In [30]:
len(s)

10000

In [31]:
%%timeit -n 100
summary = 0
for item in s:
    summary+=item

1.55 ms ± 133 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [32]:
%%timeit -n 100
summary = np.sum(s)

155 µs ± 38.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [33]:
s+=2 #adds two to each item in s using broadcasting
s.head()

0     71
1    915
2    220
3     66
4    823
dtype: int32

In [34]:
s = pd.Series([1, 2, 3])
s.loc['Animal'] = 'Bears'
s

0             1
1             2
2             3
Animal    Bears
dtype: object

In [35]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)

In [36]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [37]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [38]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [39]:
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

# The Data Frame Data Structure

In [40]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [41]:
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [42]:
type(df.loc['Store 2'])

pandas.core.series.Series

## Example 1

For the purchase records from the pet store, how would you get a list of all items which had been purchased (regardless of where they might have been purchased, or by whom)?

In [43]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [44]:
df['Item Purchased']

Store 1        Dog Food
Store 1    Kitty Litter
Store 2       Bird Seed
Name: Item Purchased, dtype: object

In [45]:
df.loc['Store 1', 'Item Purchased']

Store 1        Dog Food
Store 1    Kitty Litter
Name: Item Purchased, dtype: object

In [46]:
df.T # Transpose df

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [47]:
df.loc['Store 1']['Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [48]:
df.loc[:, ['Name', 'Cost']] # Choose 'Name' and 'Cost' columns from all rows

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [49]:
df.loc['Store 2', ['Name', 'Cost']]

Name    Vinod
Cost        5
Name: Store 2, dtype: object

In [50]:
df.drop('Store 1') # Drop a given row

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [51]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [52]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')

In [53]:
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [54]:
del copy_df['Name'] # Immediately affects the copy
copy_df

        Item Purchased  Cost
Store 2      Bird Seed   5.0

In [55]:
df['Location'] = None # Adding a new column 'Location' with default value 'None'

In [56]:
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 1  Kevyn   Kitty Litter   2.5     None
Store 2  Vinod      Bird Seed   5.0     None

## Example 2

For the purchase records from the pet store, how would you update the DataFrame, applying a discount of 20% across all the values in the 'Cost' column?

In [57]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

In [58]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [59]:
df['Cost'] = df['Cost'] * 0.8
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  18.0
Store 1  Kevyn   Kitty Litter   2.0
Store 2  Vinod      Bird Seed   4.0

# Dataframe Indexing and Loading

In [60]:
costs = df['Cost']
costs # Create a series

Store 1    18.0
Store 1     2.0
Store 2     4.0
Name: Cost, dtype: float64

In [61]:
costs += 2 # Broadcasting
costs

Store 1    20.0
Store 1     4.0
Store 2     6.0
Name: Cost, dtype: float64

In [62]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  20.0
Store 1  Kevyn   Kitty Litter   4.0
Store 2  Vinod      Bird Seed   6.0

In [63]:
# df = pd.read_csv('olympics.csv', index_col = 0, skiprows=1) # Set which column to be used as index

In [64]:
# Iterate over columns to rename

for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold' + col[4:]}, inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver' + col[4:]}, inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze' + col[4:]}, inplace=True)
    if col[:1]=='№':
        df.rename(columns={col:'#' + col[1:]}, inplace=True)

# Querying a Dataframe

## Boolean Masking

The heart of fast and efficient querying in NumPy.

In [65]:
# df['Gold'] > 0

In [66]:
#only_gold = df.where(df['Gold'] > 0)
#only_gold.head()

In [67]:
#only_gold = only_gold.dropna()
#only_gold.head()

In [68]:
#only_gold = df[df['Gold'] > 0]

In [69]:
#len(df[(df['Gold'] > 0) | (df['Gold.1'] > 0)])

# Indexing Dataframes

## Example

Reindex the purchase records DataFrame to be indexed hierarchically, first by store, then by person. Name these indexes 'Location' and 'Name'. Then add a new entry to it with the value of:

Name: 'Kevyn', Item Purchased: 'Kitty Food', Cost: 3.00 Location: 'Store 2'.

In [88]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [97]:
#df = df.set_index([df.index, 'Name'])
#df.index.names = ['Location', 'Name']

In [90]:
df['Location'] = df.index # Create an extra column 'Location'
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5  Store 1
Store 1  Kevyn   Kitty Litter   2.5  Store 1
Store 2  Vinod      Bird Seed   5.0  Store 2

In [91]:
df = df.set_index(['Location', 'Name'])

In [92]:
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [93]:
df = df.append(pd.Series(data = {'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name = ('Store 2', 'Kevyn')))

In [94]:
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0
         Kevyn     Kitty Food   3.0

In [72]:
#df['country'] = df.index
#df = df.set_index('Gold')

In [73]:
#df = df.reset_index()

In [74]:
#df['SUMLEV'].unique()

In [75]:
#df=df[df['SUMLEV'] == 50]

In [76]:
#df = df.set_index(['STNAME', 'CTYNAME'])

In [77]:
#df.loc['Michigan', 'Washtenaw County']

In [78]:
#df.loc[ [('Michigan', 'Washtenaw County'), ('Michigan', 'Wayne County')] ]

# Missing Values

In [3]:
#df.fillna